//
//  Heap.swift
//  iPhoneOS
//
//  Created by XLsn0w on 2020/2/22.
//  Copyright © 2020 XLsn0w. All rights reserved.
//

import UIKit

class Heap: NSObject {

}
/*
 
// MARK: - Heap 堆 由程序员管理
 
  
 堆是一种经过排序的树形数据结构，每个节点都有一个值，通常我们所说的堆的数据结构是指二叉树。所以堆在数据结构中通常可以被看做是一棵树的数组对象。而且堆需要满足一下两个性质：

 1）堆中某个节点的值总是不大于或不小于其父节点的值；

 2）堆总是一棵完全二叉树。

 堆分为两种情况，有最大堆和最小堆。将根节点最大的堆叫做最大堆或大根堆，根节点最小的堆叫做最小堆或小根堆，在一个摆放好元素的最小堆中，父结点中的元素一定比子结点的元素要小，但对于左右结点的大小则没有规定谁大谁小。

 堆常用来实现优先队列，堆的存取是随意的，
 
 这就如同我们在图书馆的书架上取书，虽然书的摆放是有顺序的，但是我们想取任意一本时不必像栈一样，先取出前面所有的书，书架这种机制不同于箱子，我们可以直接取出我们想要的书。


 

*/
